const services = [
  {
    iconSrc: "/icons/meal-plan.png",
    iconAlt: "Meal Plan",
    title: "Διατροφική Αξιολόγηση & Σχεδιασμός Γευμάτων",
    description:
      "Ακούμε και αναλύουμε τις διατροφικές σου συνήθειες, βασισμένες στις πραγματικές σου ανάγκες και τον τρόπο ζωής σου, και φτιάχνουμε ΜΑΖΙ υγιεινά και απολαυστικά γεύματα που ταιριάζουν στην καθημερινότητά σου."
  },
  {
    iconSrc: "/icons/menopause.png",
    iconAlt: "Menopause",
    title: "Διατροφή στην Εμμηνόπαυση - Ανδρόπαυση",
    description:
      "Σε αυτή τη δύσκολη φάση ζωής, που το σώμα σου μοιάζει να μην είναι σύμμαχος, μετατρέπουμε την «απειλή» σε μοναδική ευκαιρία αλλαγής. Πραγματικά, γίνεται!",
  },
  {
    iconSrc: "/icons/sports.png",
    iconAlt: "Sports Nutrition",
    title: "Αθλητική Διατροφή",
    description:
      "Σχεδιάζουμε και παρακολουθούμε τη διατροφή αθλητών στα πρώτα τους βήματα,  με στόχο τη βελτίωση της απόδοσης, της αποκατάστασης και την διατροφική τους εκπαίδευσή τους.",
  },
  {
    iconSrc: "/icons/corporate.png",
    iconAlt: "Corporate",
    title: "Corporate Wellbeing",
    description:
      "Λόγω της προηγούμενής μας εμπειρίας σε Corporate περιβάλλον, σχεδιάζουμε και υλοποιούμε προγράμματα Wellbeing για το προσωπικό εταιρειών, με onsite ή online συνεδρίες διατροφολόγων και όχι μόνο, webinars ή ομιλίες για θέματα που αφορούν στον σύγχρονο εργαζόμενο και τις οικογένειές του.",
  },
  {
    iconSrc: "/icons/education.png",
    iconAlt: "Education",
    title: "Εκπαιδεύσεις & Webinars",
    description:
      "Διοργανώνουμε εκπαιδευτικά προγράμματα και σεμινάρια – δια ζώσης και διαδικτυακά – τόσο για την Ελλάδα όσο και για το Εξωτερικό, με θέματα διατροφής, ευεξίας και συνολικής υγείας, πάντα στοχευμένα καλύπτοντας τις ανάγκες του κοινού.",
  },
];

export default services;
