import Image from "next/image";
import Link from "next/link";

export default function AboutOwnerSection() {
  return (
    <section className="py-12">
      <div className="max-w-6xl mx-auto px-4 flex flex-col md:flex-row gap-8 items-center">
        {/* Left: Image */}
        <div className="flex-1">
          <div className="relative w-full h-[90vh]">
            <Image
              src="/images/tonia/5.jpg"
              alt="Owner"
              fill
              className="rounded-xl shadow-lg object-cover"
            />
          </div>
        </div>

        {/* Right: Text */}
        <div className="flex-1">
          <h2 className="title-teal">
            Η διατροφή σου δεν είναι το πρόβλημα — Είναι το σύμπτωμα
          </h2>
          <div className="mb-4">
            {/*<p className="mb-4">*/}
            {/*  Ονομάζομαι Τόνια Καπαρελιώτη και είμαι η ιδρύτρια του διατροφικού χώρου <span*/}
            {/*  className="font-great-vibes font-bold text-xl">Believe in Yourself</span>. Έχω*/}
            {/*  πολυετή εμπειρία στη διατροφολογία και εξειδικεύομαι στην προσωπική καθοδήγηση*/}
            {/*  ανθρώπων που θέλουν να σταματήσουν να "<i>κάνουν δίαιτα</i>" και να αρχίσουν να φροντίζουν*/}
            {/*  ουσιαστικά τον εαυτό τους.*/}
            {/*</p>*/}
            {/*<p className="mb-4">*/}
            {/*  Πιστεύω βαθιά πως η διατροφή δεν είναι απλώς θέμα θερμίδων — είναι και θέμα <strong className="text-teal-800">συναισθημάτων,*/}
            {/*  συμπεριφορών και εσωτερικών εμποδίων</strong>. Η ικανότητά μου να συνδέομαι με τον κάθε άνθρωπο που*/}
            {/*  έχω απέναντί μου είναι το πιο δυνατό μου εργαλείο.*/}
            {/*</p>*/}
            {/*<p className="mb-4">*/}
            {/*  Με τη βοήθεια του NLP (Νευρογλωσσικού Προγραμματισμού), θα σε βοηθήσω να κατανοήσεις <strong className="text-teal-800">όχι*/}
            {/*  μόνο*/}
            {/*  τι να φας, αλλά και γιατί τρως</strong>, ώστε να αλλάξεις από τη ρίζα τις διατροφικές σου*/}
            {/*  συνήθειες και να φτάσεις στους στόχους σου με έναν τρόπο που σου ταιριάζει.*/}
            {/*</p>*/}
            {/*<p>*/}
            {/*  ✨ Όταν ελευθερωθείς από τα ψυχικά βάρη που σε κρατούν πίσω, τότε μπορείς να*/}
            {/*  αγαπήσεις ξανά το σώμα και τη διατροφή σου. Μαζί θα χτίσουμε μια <strong className="text-teal-800">καθημερινότητα*/}
            {/*  γεμάτη*/}
            {/*  ισορροπία, αυτοεκτίμηση και ουσιαστική φροντίδα</strong>.*/}
            {/*</p>*/}

            <p className="mb-4">
              Δεν πιστεύω στις "δίαιτες". Πιστεύω στη φροντίδα. Με πολυετή εμπειρία στη διατροφολογία, έχω βοηθήσει
              πολλούς ανθρώπους να σταματήσουν να ζουν με ενοχές γύρω από το φαγητό και να αποκτήσουν ξανά ισορροπία και
              σύνδεση με τον εαυτό τους.
            </p>

            <p className="mb-4">
              Η διατροφή δεν είναι απλώς θέμα θερμίδων — είναι και θέμα συναισθημάτων, συμπεριφορών και
              εσωτερικών εμποδίων. Γι' αυτό προτεραιότητά μου είναι να σε ακούσω και να σε καταλάβω ουσιαστικά,
              ώστε να μπορώ να σε στηρίξω με τρόπο που πραγματικά σου ταιριάζει.
            </p>
            <p>
              Με τη βοήθεια εργαλείων όπως ο Νευρογλωσσικός Προγραμματισμός (NLP), οι αλλαγές δεν αργούν να φανούν.
              Όταν καταλάβεις όχι μόνο τι να φας, αλλά και γιατί τρως, τότε απελευθερώνεσαι πραγματικά. Και αυτό δεν
              αλλάζει μόνο τη διατροφή σου — αλλάζει τη ζωή σου συνολικά.
            </p>


          </div>

          <div className="mt-12">
            <Link href="/about-us" className="btn">
              Μάθε περισσότερα για εμένα
            </Link>
          </div>
        </div>
      </div>
    </section>
  );
}
