import IntroSection from "../components/IntroSection";
import FirstSession from "../components/services/FirstSession";
import ServicesSection from "../components/services/ServicesSection";
import Footer from "../components/Footer";
import Navbar from "../components/Navbar";
import services from "../../../public/data/services";
import AboutSection from "../components/AboutSection";


export default function ServicesPage() {
  return (
    <>
      <Navbar/>
      <main className="w-full mt-16">
        <IntroSection
          image="/images/office/25.webp"
          title="Οι Υπηρεσίες μας"
          paragraph={
            <p>
              Στη <strong className="font-great-vibes">Believe in Yourself</strong>, οι υπηρεσίες μας δεν περιορίζονται σε τυπικά διαιτολόγια, αλλά αγγίζουν βαθύτερα τις συνήθειες και τα συναισθήματα που συνδέονται με τη διατροφή μας. Μαζί δημιουργούμε ρεαλιστικά, άμεσα εφαρμόσιμα πλάνα που ταιριάζουν στη δική σου ζωή, και αντιμετωπίζουμε τα βάρη που μπλοκάρουν τη ζωή και τη διατροφή σου.
            </p>
          }
        />

        <ServicesSection
          title="Οι υπηρεσίες μας"
          paragraphs={[
            "Με ένα φάσμα υπηρεσιών, προσπαθούμε να καλύψουμε ανάγκες καθημερινών ανθρώπων που χρειάζονται φροντίδα. Τόσο σε προσωπικό όσο και σε εταιρικό επίπεδο, προτεραιότητά μας είναι να ακούσουμε την ανάγκη του καθενός και μετά να περάσουμε στη σωστή πρακτική και στοχοθεσία."
          ]}
          services={services}
        />

        <AboutSection
          title="Φεύγοντας, πάρε κάτι μαζί σου!"
          image="/images/general/laptop.webp"
          reverse={true}
          fullWidthTitle={false}
          description={[
            `Η διατροφή δεν τελειώνει στο γραφείο. Με την <strong>προσωπική ηλεκτρονική πλατφόρμα</strong> που δημιουργήσαμε, κάθε πελάτης μας έχει τον δικό του λογαριασμό και πρόσβαση σε όλα τα αρχεία του – <strong>διατροφές</strong>, <strong>μετρήσεις</strong> και <strong>φωτογραφίες προόδου</strong>. Έτσι, κάθε φορά που φεύγεις από το ραντεβού, «παίρνεις» μαζί σου κάτι χειροπιαστό, που μπορείς να δεις και να αξιοποιήσεις ανά πάσα στιγμή.`,
            `Η πλατφόρμα δεν είναι απλώς αποθήκευση αρχείων. Είναι ένα <strong>εργαλείο παρακολούθησης και εξέλιξης</strong>, που σου δείχνει καθαρά την πρόοδό σου, σε κρατά οργανωμένο και σου δίνει συνεχή υποστήριξη. Με αυτόν τον τρόπο, η συνεργασία μας γίνεται πιο ουσιαστική, πιο διαδραστική και προσαρμοσμένη στους ρυθμούς σου.`
          ]}
          ticks={[
            "Πρόσβαση σε διατροφές, μετρήσεις & φωτογραφίες",
            "Προσωπικός λογαριασμός για κάθε πελάτη",
            "Συνεχής παρακολούθηση της προόδου"
          ]}
          ctaText="Συνδέσου στην πλατφόρμα"
          ctaLink="/login"
        />

        <AboutSection
          title="Το DNA σου κρύβει τα μυστικά της διατροφής σου"
          image="/images/general/dna.webp"
          fullWidthTitle={false}
          reverse={false}
          description={[
            "Με το <strong>DNA Test 3 σε 1</strong>, που προσφέρουμε, ανακαλύπτεις πώς το σώμα σου ανταποκρίνεται σε θρεπτικά συστατικά, βιταμίνες και άσκηση. Έτσι, αντί για γενικές οδηγίες, αποκτάς ένα <strong>προσωποποιημένο πλάνο διατροφής</strong> με πληροφορίες εκ των έσω. Δεν μαντεύουμε! Απαντάμε στη φύση!",
            "Το τεστ αποκαλύπτει ευαισθησίες σε: λακτόζη, γλουτένη, υδατάνθρακες κ.ά., πιθανές ελλείψεις σε βιταμίνες και προδιάθεση σε τραυματισμούς. Με αυτά τα δεδομένα, σχεδιάζουμε μαζί ένα <strong>στοχευμένο πρόγραμμα διατροφής και ευεξίας</strong>, ώστε να πετύχεις τους στόχους σου με ασφάλεια και επιστημονική τεκμηρίωση."
          ]}
          ticks={[
            "Εξατομικευμένη διατροφή",
            "Πρόληψη ελλείψεων βιταμινών",
            "Βελτίωση ευεξίας & επιδόσεων"
          ]}
        />

        <AboutSection
          title="Μάθε την ποιότητα του σώματός σου μέσα από αξιόπιστη τεχνολογία"
          image="/images/general/TANITA-2.jpg"
          reverse={true}
          fullWidthTitle={false}
          description={[
            `Με το <strong>TANITA MC-780 MA-N</strong>, έχεις τη δυνατότητα να μάθεις με ακρίβεια:`,
          ]}
          ticks={[
            "Τον βασικό μεταβολισμό σου",
            "Σε % και κιλά το λίπος και τους μύες του σώματός σου",
            "Πιθανές κατακρατήσεις στο σώμα",
            "Να αναγνωρίσεις αναλυτικά πώς είναι δομημένο το σώμα σου"
          ]}
          ctaText="Κλείσε το ραντεβού σου"
          ctaLink="/contact"
        />

        <FirstSession/>

        <AboutSection
          title="Online Συνεδρίες"
          image="/images/general/online-meeting.webp"
          reverse
          fullWidthTitle={false}
          description={[
            `Η σύγχρονη τεχνολογία μας επιτρέπει να συνεργαστούμε από όπου κι αν βρίσκεσαι — στο σπίτι, στο γραφείο ή ακόμα και στο εξωτερικό — με την ίδια άνεση και αποτελεσματικότητα!`,

            `Τα ραντεβού πραγματοποιούνται μέσω Microsoft Teams, Zoom, Viber ή ό,τι άλλο σε διευκολύνει, με εύκολη σύνδεση και χωρίς πολύπλοκες διαδικασίες.`,

            `Η εμπειρία είναι εξίσου προσωπική και υποστηρικτική με τη δια ζώσης συνεδρία, χωρίς να επηρεάζεται από την απόσταση ή τον τόπο διαμονής σου.`,

            `<i>Μαζί μπορούμε να πετύχουμε κάθε στόχο — <strong>όπου κι αν βρίσκεσαι!</strong></i>`,
          ]}
        />

        <Footer/>

      </main>
    </>
  );
}
